app/controllers/charges_controller.rb

	def create
	  product = Product.find(params[:product_id])

	  customer = Stripe::Customer.create(
	    :email => params[:stripeEmail],
	    :card  => params[:stripeToken],
	    :plan  => "GROHACK2"
	  )

	  #charge = Stripe::Charge.create(
	  #  :customer    => customer.id,
	  #  :amount      => product.price_in_cents,
	  #  :description => product.full_description,
	  #  :currency    => 'usd'
	  # )

	  purchase = Purchase.create(email: params[:stripeEmail], card: params[:stripeToken],
      amount: product.price_in_cents, description: product.full_description, currency: 'usd',
      customer_id: customer.id, product_id: product.id, uuid: SecureRandom.uuid)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "purchases" ("amount", "card", "created_at", "currency", "customer_id", "description", "email", "product_id", "updated_at", "uuid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)