app/controllers/pages_controller.rb

SELECT "products".* FROM "products" WHERE "products"."sku" = 'GROHACK1' LIMIT 1
---
	def home
	  @product = Product.find_by_sku("GROHACK1")