app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases" WHERE "purchases"."uuid" = '1' LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
   @purchase = Purchase.find_by_uuid(params[:id])
   @product = Product.find(@purchase.product_id)